brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "neovim"
brew "pnpm"
brew "python@3.10"
brew "starship"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "antigravity"
cask "betterdisplay"
cask "bitwarden"
cask "commander-one"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "logi-options+"
cask "obsidian"
cask "pgadmin4"
cask "raycast"
cask "rectangle"
cask "rider"
cask "sublime-text"
cask "transmission"
cask "visual-studio-code"
cask "zen"
vscode "ms-ossdata.vscode-pgsql"
go "golang.org/x/tools/gopls"
