brew "fzf"
brew "humanlog"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "neovim"
brew "pnpm"
brew "starship"
brew "tmux"
brew "eza"
brew "zoxide"
brew "zsh"
brew "nvm"
brew "opentofu"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "betterdisplay"
cask "bitwarden"
cask "commander-one"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "logi-options+"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
cask "zen"
