tap "anomalyco/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Logs for humans to read
brew "humanlog"
# Handy way to save and run project-specific commands
brew "just"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# AI coding agent, built for the terminal
brew "opencode"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Free Terraform
brew "opentofu"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# Two-panel file manager
cask "commander-one"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Software for Logitech devices
cask "logi-options+"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# .NET IDE
cask "rider"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Gecko based web browser
cask "zen"
vscode "ms-ossdata.vscode-pgsql"
